# Microsemi Corp.
# Date: 2020-Dec-01 13:28:14
# This file was generated based on the following SDC source files:
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/ROC_CCC/ROC_CCC_0/ROC_CCC_ROC_CCC_0_PF_CCC.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/AXI4_Interconnect/AXI4_Interconnect_0/AXI4_Interconnect.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/DDR3_Cntrl/DDR3_Cntrl.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/DDR3_Cntrl/CCC_0/DDR3_Cntrl_CCC_0_PF_CCC.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/DDR3_Cntrl/DLL_0/DDR3_Cntrl_DLL_0_PF_CCC.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/TransceiverIF/I_XCVR/TransceiverIF_I_XCVR_PF_XCVR.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/TxPLL/TxPLL_0/TxPLL_TxPLL_0_PF_TX_PLL.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/PF_CLK_DIV_C0/PF_CLK_DIV_C0_0/PF_CLK_DIV_C0_PF_CLK_DIV_C0_0_PF_CLK_DIV.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/RXCCC/RXCCC_0/RXCCC_RXCCC_0_PF_CCC.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/ALGO_CLK_PLL_0/ALGO_CLK_PLL_0_0/ALGO_CLK_PLL_0_ALGO_CLK_PLL_0_0_PF_CCC.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/PF_XCVR_ERM_C0/I_XCVR/PF_XCVR_ERM_C0_I_XCVR_PF_XCVR.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/XCVR_PLL_0/XCVR_PLL_0_0/XCVR_PLL_0_XCVR_PLL_0_0_PF_TX_PLL.sdc
#   D:/ywu/ROC_TCL/work_04bfb96/component/work/TrackerCCC/TrackerCCC_0/TrackerCCC_TrackerCCC_0_PF_CCC.sdc
#   C:/Microsemi/Libero_SoC_v12.5/Designer/data/aPA5M/cores/constraints/osc_rc160mhz.sdc
#

create_clock -name {ROC_CLK_P} -period 20 [ get_ports { ROC_CLK_P } ]
create_clock -name {SERDES_CAL_CLK_P} -period 10 [ get_ports { SERDES_CAL_CLK_P } ]
create_clock -name {DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE0/TX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE0/TX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE0/RX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE0/RX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE1/TX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE1/TX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE1/RX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_0/TransceiverIF_0/I_XCVR/LANE1/RX_CLK_R } ]
create_clock -name {SERDES_HV_CLK_P} -period 10 [ get_ports { SERDES_HV_CLK_P } ]
create_clock -name {DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE0/TX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE0/TX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE0/RX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE0/RX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE1/TX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE1/TX_CLK_R } ]
create_clock -name {DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE1/RX_CLK_R} -period 6.66667 [ get_pins { DIGIINTERFACE_0/serdes_1/TransceiverIF_0/I_XCVR/LANE1/RX_CLK_R } ]
create_clock -name {REF_CLK_PAD_P} -period 10 [ get_ports { REF_CLK_PAD_P } ]
create_clock -name {TOP_SERDES_0/XCVR_Block_0/XCVR_IF_0/I_XCVR/LANE0/TX_CLK_R} -period 5 [ get_pins { TOP_SERDES_0/XCVR_Block_0/XCVR_IF_0/I_XCVR/LANE0/TX_CLK_R } ]
create_clock -name {TOP_SERDES_0/XCVR_Block_0/XCVR_IF_0/I_XCVR/LANE0/RX_CLK_R} -period 5 [ get_pins { TOP_SERDES_0/XCVR_Block_0/XCVR_IF_0/I_XCVR/LANE0/RX_CLK_R } ]
create_clock -name {PF_OSC_C0_0/PF_OSC_C0_0/I_OSC_160/CLK} -period 6.25 [ get_pins { PF_OSC_C0_0/PF_OSC_C0_0/I_OSC_160/CLK } ]
create_generated_clock -name {CCC_0/ROC_CCC_0/pll_inst_0/OUT0} -divide_by 1 -source [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {CCC_0/ROC_CCC_0/pll_inst_0/OUT1} -divide_by 1 -source [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/OUT1 } ]
create_generated_clock -name {CCC_0/ROC_CCC_0/pll_inst_0/OUT2} -multiply_by 20 -divide_by 9 -source [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/OUT2 } ]
create_generated_clock -name {CCC_0/ROC_CCC_0/pll_inst_0/OUT3} -multiply_by 2 -source [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { CCC_0/ROC_CCC_0/pll_inst_0/OUT3 } ]
create_generated_clock -name {DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT0} -multiply_by 4 -source [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT1} -divide_by 1 -source [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT1 } ]
create_generated_clock -name {DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT2} -multiply_by 4 -source [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT2 } ]
create_generated_clock -name {DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT3} -multiply_by 4 -source [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/OUT3 } ]
create_generated_clock -name {PF_CLK_DIV_C0_0/PF_CLK_DIV_C0_0/I_CD/Y_DIV} -divide_by 4 -source [ get_pins { PF_CLK_DIV_C0_0/PF_CLK_DIV_C0_0/I_CD/A } ] [ get_pins { PF_CLK_DIV_C0_0/PF_CLK_DIV_C0_0/I_CD/Y_DIV } ]
create_generated_clock -name {RXCCC_0/RXCCC_0/pll_inst_0/OUT0} -multiply_by 4 -source [ get_pins { RXCCC_0/RXCCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { RXCCC_0/RXCCC_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {TOP_SERDES_0/ALGO_CLK_PLL_1/ALGO_CLK_PLL_0_0/pll_inst_0/OUT0} -divide_by 5 -source [ get_pins { TOP_SERDES_0/ALGO_CLK_PLL_1/ALGO_CLK_PLL_0_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { TOP_SERDES_0/ALGO_CLK_PLL_1/ALGO_CLK_PLL_0_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {TrackerCCC_0/TrackerCCC_0/pll_inst_0/OUT0} -multiply_by 4 -divide_by 5 -source [ get_pins { TrackerCCC_0/TrackerCCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { TrackerCCC_0/TrackerCCC_0/pll_inst_0/OUT0 } ]
set_false_path -through [ get_nets { DDRInterface_0/AXI4_Interconnect_0/ARESETN* } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_IOD_*/ARST_N } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_*_CTRL/I_LANECTRL/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANECTRL_ADDR_CMD_0/I_LANECTRL*/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_IOD_*/RX_SYNC_RST* } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_MOVE } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_OUT_OF_RANGE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_LOAD DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_LOAD DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DELAY_LINE_LOAD DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_2_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DELAY_LINE_LOAD DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/LANE_3_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_*FEEDBACK*/Y } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/OB_DIFF_CK0/Y } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/OB_A_12/Y } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/D } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/E } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_BIBUF*/D } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_BIBUF*/E } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_BIBUF*/Y } ]
set_false_path -through [ get_pins { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/*/I_BIBUF_DIFF_DQS_*/YN } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/PHASE_OUT0_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/PHASE_OUT2_SEL } ]
set_false_path -to [ get_pins { DDRInterface_0/DDR3_Cntrl_0/CCC_0/pll_inst_0/PHASE_OUT3_SEL } ]
set_multicycle_path -setup_only 2 -from [ get_cells { DDRInterface_0/DDR3_Cntrl_0/DDRPHY_BLK_0/IOD_TRAINING_0/COREDDR_TIP_INT_U/TIP_CTRL_BLK/u_write_callibrator/select* } ]
